# NetflixChannel


Identify all accounts that watched only Netflix in a particular month, and the number of hours they watched. Note that an account can have multiple devices and can watch mutliple channels.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [ ]:
%%html
<style>
table {float:left}
</style>

In [3]:
%%sql

DROP TABLE IF EXISTS streaming_data;
CREATE TABLE streaming_data (
    account_id INT,
    device_id INT,
    channel_name VARCHAR,
    play_hours FLOAT,
    watch_date DATE
);

INSERT INTO streaming_data
VALUES
    (1, 1, 'Netflix',         0.5, '2021-01-01'),
    (1, 1, 'Netflix',         0.5, '2021-01-02'),
    
    (2, 2, 'Hulu',            0.5, '2021-01-02'),
    (2, 3, 'Amazon Prime',    1.5, '2021-01-02'),
    (2, 3, 'Netflix',         1.5, '2021-01-03'),    
    
    (3, 4, 'Disney+',         1.7, '2021-01-03'),
    (3, 4, 'Netflix',         0.5, '2021-01-03'),    
    (3, 4, 'Disney+',         1.7, '2021-01-04'),
    
    (4, 5, 'Netflix',         2.0, '2021-01-03'),
    (4, 6, 'Netflix',         0.5, '2021-01-04'),
    
    (5, 7, 'Hulu',            0.5, '2021-01-03');
    
SELECT * FROM streaming_data;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
11 rows affected.
11 rows affected.

[(1, 1, 'Netflix', 0.5, datetime.date(2021, 1, 1)),
 (1, 1, 'Netflix', 0.5, datetime.date(2021, 1, 2)),
 (2, 2, 'Hulu', 0.5, datetime.date(2021, 1, 2)),
 (2, 3, 'Amazon Prime', 1.5, datetime.date(2021, 1, 2)),
 (2, 3, 'Netflix', 1.5, datetime.date(2021, 1, 3)),
 (3, 4, 'Disney+', 1.7, datetime.date(2021, 1, 3)),
 (3, 4, 'Netflix', 0.5, datetime.date(2021, 1, 3)),
 (3, 4, 'Disney+', 1.7, datetime.date(2021, 1, 4)),
 (4, 5, 'Netflix', 2.0, datetime.date(2021, 1, 3)),
 (4, 6, 'Netflix', 0.5, datetime.date(2021, 1, 4)),
 (5, 7, 'Hulu', 0.5, datetime.date(2021, 1, 3))]

In [17]:
%%sql

WITH only_netflix AS (
    SELECT 
        *,
        CASE
        WHEN channel_name = 'Netflix' 
        THEN 0
        ELSE 1
        END AS not_netflix
    FROM streaming_data
),

other_than_netflix AS (
    SELECT 
        account_id,
        SUM(play_hours) as total_hours,
        SUM(not_netflix) as non_netflix_channels_watched
    FROM 
        only_netflix
    GROUP BY account_id
)

SELECT 
    account_id, total_hours
FROM other_than_netflix 
WHERE non_netflix_channels_watched = 0 
ORDER BY account_id

 * postgresql://fknight:***@localhost/postgres
2 rows affected.

[(1, 1.0), (4, 2.5)]